wrig0421/spud-firmware/STM32/stm32_workspace/spudglo/src/bsp/stmicro/stm32l4/board_specific/board_init_spudglo_v5/peripheral/uart/board_spudglo_v5_uart_config.c
// SRW
#include "config.h"

#if defined(BOARD_SPUDGLO_V5P0)
#include "stm32l4xx_hal.h"

#include "uart_config_hal.h"


#define PIN_XR_TX               GPIO_PIN_0
#define PIN_XR_RX               GPIO_PIN_1


UART_HandleTypeDef g_uart_handle_config[NUM_UART_CONFIG_BUSES] =
{
		[UART_CONFIG_BUS_HOST] =
		{
				.Instance = LPUART1,
				.Init.BaudRate = 9600,
				.Init.WordLength = UART_WORDLENGTH_8B,
			    .Init.StopBits = UART_STOPBITS_1,
			    .Init.Parity = UART_PARITY_NONE,
			    .Init.Mode           = UART_MODE_TX_RX,
			    .Init.HwFlowCtl      = UART_HWCONTROL_NONE,
			    .Init.OverSampling = UART_OVERSAMPLING_16,
			    .Init.OneBitSampling = UART_ONE_BIT_SAMPLE_DISABLE,
			    .AdvancedInit.AdvFeatureInit = UART_ADVFEATURE_NO_INIT,
			    .AdvancedInit.OverrunDisable = UART_ADVFEATURE_RXOVERRUNDISABLE_INIT|UART_ADVFEATURE_DMADISABLEONERROR_INIT,
			    .AdvancedInit.DMADisableonRxError = UART_ADVFEATURE_DMA_DISABLEONRXERROR
		}
};


const uart_config_t g_uart_config[NUM_UART_CONFIG_BUSES] =
{
	[UART_CONFIG_BUS_HOST] =
	{
			.pin.rx = PIN_XR_TX,
			.pin.rx_port = GPIOC,
			.pin.rx_alt_func = GPIO_AF8_LPUART1,
			.pin.tx = PIN_XR_RX,
			.pin.tx_port = GPIOC,
			.pin.tx_alt_func = GPIO_AF8_LPUART1,
			.irqn = LPUART1_IRQn
	}
};





#endif

